load-test.yaml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    - duration: 60
      arrivalRate: 50
      name: "Sustained load"
scenarios:
  - name: "Search Laptops (Smart Options)"
    flow:
      - get:
          url: "/api/laptops/all"